-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Время создания: Июн 15 2024 г., 16:29
-- Версия сервера: 10.11.6-MariaDB-1:10.11.6+maria~ubu2004
-- Версия PHP: 8.1.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `smirnova_cat-world`
--

-- --------------------------------------------------------

--
-- Структура таблицы `admins`
--

CREATE TABLE `admins` (
  `id_admin` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `login` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Дамп данных таблицы `admins`
--

INSERT INTO `admins` (`id_admin`, `username`, `login`, `password`) VALUES
(1, 'Admin', 'admin', '$2y$10$duynLJTRq.1H36BM0/5yf.xOCok5A4C3x5bpd0TAjx5jh.Nv5N1LK'),
(2, 'Кристина', 'adminkris', '$2y$10$z4tQpMLxFEFtWvTXDpRDsuIaTFMyS9AOTERGacHo1rj09piNADRJi');

-- --------------------------------------------------------

--
-- Структура таблицы `ages`
--

CREATE TABLE `ages` (
  `id_age` int(11) NOT NULL,
  `age_title` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Дамп данных таблицы `ages`
--

INSERT INTO `ages` (`id_age`, `age_title`) VALUES
(1, '2-3 месяца'),
(2, '3-4 месяца'),
(3, '5-6 месяцев'),
(4, '7-8 месяцев');

-- --------------------------------------------------------

--
-- Структура таблицы `breeds`
--

CREATE TABLE `breeds` (
  `id_breed` int(11) NOT NULL,
  `breed_title` varchar(255) NOT NULL,
  `breed_description` varchar(2000) NOT NULL,
  `playfulness` tinyint(4) NOT NULL,
  `friendly_pets` tinyint(4) NOT NULL,
  `requirements` tinyint(4) NOT NULL,
  `attention` tinyint(4) NOT NULL,
  `doclity` tinyint(4) NOT NULL,
  `independence` tinyint(4) NOT NULL,
  `activity` tinyint(4) NOT NULL,
  `friendly_children` tinyint(4) NOT NULL,
  `vocality` tinyint(4) NOT NULL,
  `affection` tinyint(4) NOT NULL,
  `inteligence` tinyint(4) NOT NULL,
  `hardiness` tinyint(4) NOT NULL,
  `img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Дамп данных таблицы `breeds`
--

INSERT INTO `breeds` (`id_breed`, `breed_title`, `breed_description`, `playfulness`, `friendly_pets`, `requirements`, `attention`, `doclity`, `independence`, `activity`, `friendly_children`, `vocality`, `affection`, `inteligence`, `hardiness`, `img`) VALUES
(1, 'Абиссинская кошка', 'Абиссинская кошка — это яркая представительница своей породы, обладающая ярко выраженной тикированной шерстью, средним размером и царственным видом. Она гибкая, крепкая и мускулистая, проявляет активность и живой интерес к окружающему миру. Абиссинские кошки обычно хорошо сбалансированы как в плане темперамента, так и в физическом развитии.', 5, 3, 2, 4, 1, 3, 5, 2, 1, 4, 4, 1, 'assets\\img\\breeds\\породы\\Абиссинская.png'),
(2, 'Американский бобтейл', 'Американский бобтейл – это кошка средних или крупных размеров с естественным коротким хвостом. Эти животные отличаются спортивным телосложением и развитой мускулатурой, что придает им мощный вид. У них природный взгляд охотника, который в сочетании с особенностями телосложения создаёт впечатление дикости.', 4, 4, 3, 4, 2, 3, 4, 4, 3, 5, 4, 4, 'assets\\img\\breeds\\породы\\АмерикансикйБобтейл.png'),
(3, 'Американская короткошерстная', 'Американская короткошёрстная кошка — это порода, которая отличается сильным, хорошо сбалансированным и симметричным телосложением. Экстерьер этой кошки указывает на её силу, выносливость и ловкость.', 4, 4, 1, 3, 4, 4, 2, 4, 1, 3, 3, 4, 'assets\\img\\breeds\\породы\\АмериканскаяКороткошерстная.png'),
(4, 'Бенгальская кошка', 'Бенгальская кошка — это домашняя кошка, которая имеет физические особенности, характерные для небольших лесных диких кошек, а также дружелюбный и преданный характер. Это означает, что некоторые черты внешности бенгальской кошки отличаются от черт других домашних кошек.', 5, 2, 1, 4, 1, 2, 5, 2, 2, 4, 5, 3, 'assets\\img\\breeds\\породы\\Бенгальская.png'),
(5, 'Бирманская кошка', 'Бирманская кошка — это полудлинношёрстная порода среднего размера с крепким костяком и мускулистым развитием. Она отличается округлой головой, выразительными глазами и милым выражением лица.', 5, 3, 1, 4, 1, 2, 4, 3, 4, 5, 4, 3, 'assets\\img\\breeds\\породы\\Бирманская.png'),
(6, 'Британская кошка', 'Британская короткошёрстная кошка — это мощное животное с короткой и густой шерстью. Они производят впечатление баланса и пропорций, где каждая деталь идеально подобрана.', 3, 4, 2, 1, 4, 4, 2, 4, 2, 3, 4, 3, 'assets\\img\\breeds\\породы\\Британская.png'),
(7, 'Корниш-рекс', 'Корниш-рекс — это порода кошек с чрезвычайно мягкой, волнистой шерстью и колоритным типом. Эти животные тяжёлые и тёплые на ощупь, а их контуры плавно изогнуты.', 5, 2, 1, 5, 1, 2, 5, 2, 1, 5, 4, 2, 'assets\\img\\breeds\\породы\\Корниш-рекс.png'),
(8, 'Девон-рекс', 'Девон-рекс — это порода кошек с уникальной внешностью. У них большие глаза, короткая морда, выдающиеся скулы и огромные низко посаженные уши, что придаёт им эльфийский вид. Девон-рексы среднего телосложения покрыты мягкой волнистой шерстью, текстура которой обусловлена мутацией, не встречающейся у других пород.', 4, 3, 1, 4, 3, 2, 4, 3, 2, 5, 4, 3, 'assets\\img\\breeds\\породы\\Девон-рекс.png'),
(9, 'Гималайская кошка', 'Гималайская кошка — это порода длинношёрстных кошек, которая похожа на персидскую, но имеет голубые глаза и окрас колор-пойнт, характерный для сиамских кошек. Гималайские кошки сильные, с отличным костяком и мускулатурой, хорошо сбалансированные и производят впечатление мощной силы.', 3, 4, 5, 4, 5, 2, 1, 4, 1, 5, 2, 2, 'assets\\img\\breeds\\породы\\Гималайская.png'),
(10, 'Мейн-кун', 'Мейн-кун — это крупная, крепкая кошка с густой, водонепроницаемой шерстью и хорошо сбалансированным внешним видом, способная адаптироваться к различным климатическим условиям.', 4, 4, 4, 3, 4, 4, 3, 4, 1, 4, 4, 5, 'assets\\img\\breeds\\породы\\Мейн-кун.png'),
(11, 'Манчкин', 'Кот породы манчкин из-за коротких лап может передвигаться медленнее своих длинноногих собратьев, но при этом он такой же любопытный и способен украсть блестящие предметы.', 5, 5, 3, 5, 4, 1, 4, 4, 2, 5, 5, 3, 'assets\\img\\breeds\\породы\\Манчкин.png'),
(12, 'Ориентальная кошка', 'Ориентальные кошки — стройные, гибкие, с длинными сужающимися линиями и мускулистым телом. У них ясные глаза и отличное физическое состояние. Они не костлявые и не дряблые. Длинношёрстные ориенталы выглядят мягче и менее экстремально, чем короткошёрстные.', 5, 3, 1, 5, 1, 1, 4, 3, 4, 4, 5, 2, 'assets\\img\\breeds\\породы\\Ориентальная.png'),
(13, 'Персидская кошка', 'Персидская кошка — это порода длинношёрстных кошек, которая отличается оригинальной внешностью, роскошной шерстью и спокойным характером. У неё хорошо сложенное, сбалансированное тело, милая мордочка и мягкие округлые линии.', 3, 4, 5, 4, 5, 2, 1, 4, 1, 4, 2, 2, 'assets\\img\\breeds\\породы\\Персидская.png'),
(14, 'Русская голубая кошка', 'Русская голубая кошка обладает густой плюшевой шерстью пепельно-голубого цвета с благородным матовым блеском. У неё тонкий скелет, изящные лапы, клиновидная мордочка и большие зелёные глаза.', 3, 3, 2, 3, 4, 4, 3, 3, 1, 3, 4, 4, 'assets\\img\\breeds\\породы\\РусскаяГолубая.png'),
(15, 'Шотландская вислоухая кошка', 'Шотландская вислоухая кошка — это порода кошек, которая возникла в результате спонтанной мутации у фермерских кошек в Шотландии. Порода была создана путём скрещивания британских короткошёрстных и домашних кошек. Все настоящие шотландские вислоухие кошки ведут свою родословную от первой представительницы породы — Сьюзи.', 4, 3, 3, 3, 4, 4, 2, 3, 1, 4, 4, 2, 'assets\\img\\breeds\\породы\\Шотландская.png'),
(16, 'Сибирская кошка', 'Сибирская кошка — это уникальная порода, которая возникла в суровых климатических условиях Сибири. Эти кошки обладают густой шерстью, защищающей их от холода, и мощным телосложением, позволяющим им выживать в сложных погодных условиях. Сибирские кошки достигают зрелости медленнее, чем другие породы, и могут весить до 9 килограммов. Их шерсть может быть разных окрасов, включая серебристый и дымчатый, а также насыщенный и чёткий рисунок.', 4, 4, 2, 3, 3, 3, 3, 4, 2, 4, 4, 5, 'assets\\img\\breeds\\породы\\Сибирская.png'),
(17, 'Сиамская кошка', 'Идеальная сиамская кошка — это стройное и утончённое животное среднего размера с длинными и сужающимися линиями, обладающее гибкостью и мускулистостью. Баланс и утончённость являются основными характеристиками породы, где все части гармонично сочетаются, без излишнего акцента на отдельных признаках.', 5, 3, 1, 5, 1, 1, 4, 2, 5, 4, 5, 2, 'assets\\img\\breeds\\породы\\Сиамская.png'),
(18, 'Сфинкс', 'Самая отличительная особенность сфинкса — отсутствие шерсти. Это кошки среднего размера и телосложения с тёплым и мягким телом на ощупь, напоминающим нежный персик или нектарин. Сфинксы покладистые, подвижные и легко управляемые.', 5, 4, 5, 5, 4, 1, 4, 4, 4, 5, 5, 4, 'assets\\img\\breeds\\породы\\Сфинкс.png');

-- --------------------------------------------------------

--
-- Структура таблицы `colors`
--

CREATE TABLE `colors` (
  `id_color` int(11) NOT NULL,
  `color_title` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Дамп данных таблицы `colors`
--

INSERT INTO `colors` (`id_color`, `color_title`) VALUES
(1, 'Черный'),
(2, 'Шоколадный'),
(3, 'Рыжий'),
(4, 'Серебристый'),
(5, 'Пятнистый'),
(6, 'Колор-поинт');

-- --------------------------------------------------------

--
-- Структура таблицы `genders`
--

CREATE TABLE `genders` (
  `id_gender` int(11) NOT NULL,
  `gender_title` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Дамп данных таблицы `genders`
--

INSERT INTO `genders` (`id_gender`, `gender_title`) VALUES
(1, 'Мужской'),
(2, 'Женский');

-- --------------------------------------------------------

--
-- Структура таблицы `kittens`
--

CREATE TABLE `kittens` (
  `id_kitten` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `breed_id` int(11) DEFAULT NULL,
  `age_id` int(11) DEFAULT NULL,
  `gender_id` int(11) DEFAULT NULL,
  `color_id` int(11) DEFAULT NULL,
  `characteristic` varchar(255) DEFAULT NULL,
  `coat_lenght` varchar(255) DEFAULT NULL,
  `house_trained` varchar(255) DEFAULT NULL,
  `health` varchar(255) DEFAULT NULL,
  `welcome` varchar(255) DEFAULT NULL,
  `kitten_description` varchar(2000) DEFAULT NULL,
  `img` varchar(255) NOT NULL,
  `reserved` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Дамп данных таблицы `kittens`
--

INSERT INTO `kittens` (`id_kitten`, `name`, `breed_id`, `age_id`, `gender_id`, `color_id`, `characteristic`, `coat_lenght`, `house_trained`, `health`, `welcome`, `kitten_description`, `img`, `reserved`) VALUES
(1, 'Феликс', 1, 1, 1, 1, 'Дружелюбный, ласковый, игривый, любопытный', 'Короткая', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Феликс — очаровательный котенок, который всегда знает, когда пришло время для игр с домашними питомцами и когда пора устроить общее время на полу! Он очень самостоятельный и умеет ясно выражать свои желания. Феликс - дружелюбный и ласковый мальчик, который ценит любовь, но только на своих условиях. Он обожает общение с людьми, особенно теми, кто умеет понимать и ладить с котятами. Если ты чувствуешь, что это про тебя - приходи знакомиться с Феликсом!', 'assets/img/kittens/Котята/1.jpg', 0),
(2, 'Габриэль', 13, 1, 2, 3, 'Дружелюбная,  Ласковая', 'Длинная', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Габриэль — спокойный и уравновешенный котёнок породы сиамская. Она любит поспать на мягких подушках и предпочитает тишину и покой. Габриэль тихая и скромная, предпочитает оставаться в тени.', 'assets/img/kittens/Котята/2.jpg', 0),
(3, 'Шарлотта', 15, 1, 2, 4, 'Дружелюбный, ласковый, игривый, любопытный', 'Средняя', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Шарлотта — милый и дружелюбный котёнок породы шотладская вислоухая. Она легко находит общий язык с другими животными и любит играть. Шарлотта общительная и активная, ей нравится проводить время со своими друзьями!', 'assets/img/kittens/Котята/3.jpg', 0),
(4, 'Рафаэль', 10, 2, 1, 5, 'Дружелюбный, ласковый, игривый, любопытный', 'Длинная', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Рафаэль — самоуверенный, дружелюбный и игривый котёнок породы мейн-кун. Он любит играть и общаться с людьми. Хорошо ладит с другими кошками.', 'assets/img/kittens/Котята/4.jpg', 0),
(5, 'Аврора', 17, 1, 2, 6, 'Дружелюбная,  Ласковая', 'Средняя', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Аврора — спокойный и уравновешенный котёнок породы сиамская. Она любит поспать на мягких подушках и предпочитает тишину и покой. Аврора тихая и скромная, предпочитает оставаться в тени.', 'assets/img/kittens/Котята/5.jpg', 0),
(6, 'Цезарь', 7, 2, 1, 6, 'Дружелюбный, ласковый, игривый, любопытный', 'Короткая', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Цезарь — милый и дружелюбный котёнок породы бенгальская кошка. Он легко находит общий язык с другими животными и любит играть. Цезарь общительный и активный, ему нравится проводить время со своими друзьями!', 'assets/img/kittens/Котята/6.jpg', 0),
(7, 'Пит', 10, 3, 1, 5, 'Дружелюбный, ласковый, игривый, любопытный', 'Длинная', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Пит — весёлый и забавный котёнок порожы мейн-кун. Он активный и любопытный, ему нравится придумывать новые игры. Пит легко находит общий язык с другими животными и любит играть.', 'assets/img/kittens/Котята/7.jpg', 0),
(8, 'Кэти', 1, 1, 2, 3, 'Дружелюбная,  Ласковая,  Игривая', 'Короткая', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Кэти – очаровательная кошечка породы абисинская. Она обладает мягким характером и легко адаптируется к новой обстановке. Кэти игривая и любознательная, ей нравится изучать окружающий мир. ', 'assets/img/kittens/Котята/8.jpg', 0),
(9, 'Скарлетт', 15, 2, 2, 4, 'Дружелюбная,  Ласковая,  Игривая', 'Средняя', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Скарлетт – милая и дружелюбная кошечка породы сиамская. Она спокойна и уравновешенна, любит проводить время на мягких подушках. Скарлетт легко находит общий язык с другими животными.', 'assets/img/kittens/Котята/9.jpg', 0),
(10, 'Чарли', 6, 2, 1, 4, 'Дружелюбный, ласковый, игривый, любопытный', 'Средняя', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Чарли – озорной и непоседливый котёнок породы британская. Он любит устраивать шалости и всегда готов к новым приключениям. Чарли легко находит общий язык с другими животными и любит играть.', 'assets/img/kittens/Котята/10.jpg', 0),
(11, 'Райли', 6, 2, 2, 4, 'Дружелюбная,  Ласковая', 'Средняя', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Райли – спокойный и уравновешенный котёнок породы персидская кошка. Она любит поспать на мягких подушках и предпочитает тишину и покой. Райли тихая и скромная, предпочитает оставаться в тени.', 'assets/img/kittens/Котята/11.jpg', 0),
(12, 'Зои', 14, 3, 2, 4, 'Дружелюбная,  Ласковая,  Игривая', 'Средняя', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Зои – умная кошечка породы русская голубая. Она легко обучается новым трюкам и быстро запоминает команды. Зои сообразительная и легко решает трудные задачи!', 'assets/img/kittens/Котята/12.jpg', 0),
(13, 'Оникс', 12, 3, 1, 6, 'Дружелюбный, ласковый, игривый, любопытный', 'Средняя', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Оникс – озорной и непоседливый котёнок породы ориентальная. Он любит устраивать шалости и всегда готов к новым приключениям. Оникс легко находит общий язык с другими животными.', 'assets/img/kittens/Котята/13.jpg', 0),
(14, 'Лео', 4, 3, 1, 5, 'Дружелюбный, ласковый, игривый, любопытный', 'Короткая', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Лео — энергичный и активный котёнок породы бенгальская. Он очень общительный и любит проводить время со своими хозяевами. Багет легко обучается различным командам и трюкам.', 'assets/img/kittens/Котята/14.jpg', 0),
(15, 'Луна', 18, 4, 2, 4, 'Дружелюбная,  Ласковая,  Игривая', 'Отсутствует', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Луна – умная кошечка породы  сфинкс. Она легко обучается новым трюкам и быстро запоминает команды. Луна сообразительная и легко решает сложные задачи.', 'assets/img/kittens/Котята/15.jpg', 0),
(16, 'Карлос', 8, 2, 1, 6, 'Дружелюбный, ласковый', 'Короткая', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Карлос – спокойный и уравновешенный котёнок породы девон-рекс. Он любит тишину и покой, предпочитает оставаться в тени. Карлос тихий и скромный, легко адаптируется к новой обстановке.', 'assets/img/kittens/Котята/16.jpg', 0),
(17, 'Блейк', 18, 4, 1, 2, 'Дружелюбный, ласковый, игривый, любопытный', 'Отсутствует', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Блейк – весёлый и забавный котёнок породы сфинкс. Он активный и любознательный, ему нравится исследовать новые территории. Блейк любит играть и всегда готов к приключениям.', 'assets/img/kittens/Котята/17.jpg', 0),
(18, 'Гром', 5, 2, 1, 2, 'Дружелюбный, ласковый, игривый, любопытный', 'Средняя', 'Да', 'Прививки сделаны, стерилизован/кастрирована.', 'Наличие в доме других кошек.', 'Гром – активный и любопытный котёнок породы бирманская. Он всегда готов к приключениям и любит исследовать новые территории. Гром легко обучается различным командам и трюкам.', 'assets/img/kittens/Котята/18.jpg', 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`id_admin`);

--
-- Индексы таблицы `ages`
--
ALTER TABLE `ages`
  ADD PRIMARY KEY (`id_age`);

--
-- Индексы таблицы `breeds`
--
ALTER TABLE `breeds`
  ADD PRIMARY KEY (`id_breed`);

--
-- Индексы таблицы `colors`
--
ALTER TABLE `colors`
  ADD PRIMARY KEY (`id_color`);

--
-- Индексы таблицы `genders`
--
ALTER TABLE `genders`
  ADD PRIMARY KEY (`id_gender`);

--
-- Индексы таблицы `kittens`
--
ALTER TABLE `kittens`
  ADD PRIMARY KEY (`id_kitten`),
  ADD KEY `age-id` (`age_id`),
  ADD KEY `breed-id` (`breed_id`),
  ADD KEY `color-id` (`color_id`),
  ADD KEY `gender-id` (`gender_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `admins`
--
ALTER TABLE `admins`
  MODIFY `id_admin` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `ages`
--
ALTER TABLE `ages`
  MODIFY `id_age` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `breeds`
--
ALTER TABLE `breeds`
  MODIFY `id_breed` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT для таблицы `colors`
--
ALTER TABLE `colors`
  MODIFY `id_color` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `genders`
--
ALTER TABLE `genders`
  MODIFY `id_gender` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `kittens`
--
ALTER TABLE `kittens`
  MODIFY `id_kitten` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `kittens`
--
ALTER TABLE `kittens`
  ADD CONSTRAINT `kittens_ibfk_1` FOREIGN KEY (`age_id`) REFERENCES `ages` (`id_age`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `kittens_ibfk_2` FOREIGN KEY (`breed_id`) REFERENCES `breeds` (`id_breed`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `kittens_ibfk_3` FOREIGN KEY (`color_id`) REFERENCES `colors` (`id_color`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `kittens_ibfk_4` FOREIGN KEY (`gender_id`) REFERENCES `genders` (`id_gender`) ON DELETE SET NULL ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
